# The Chinook Database

In [1]:
import sqlite3
%load_ext sql

In [2]:
import pandas as pd

In [3]:
%sql sqlite:///Data/Chinook.db

## The Tables
Let's see which tables are there in our database.

In [4]:
%%sql
SELECT name FROM sqlite_master 
WHERE type IN ('table','view') 
AND name NOT LIKE 'sqlite_%'
ORDER BY 1;

 * sqlite:///Data/Chinook.db
Done.

[('albums',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoice_items',),
 ('invoices',),
 ('media_types',),
 ('playlist_track',),
 ('playlists',),
 ('tracks',)]

The following query shows 5 entries of the 'albums' table.

In [6]:
%%sql
select * from albums limit 5;

 * sqlite:///Data/Chinook.db
Done.

[(1, 'For Those About To Rock We Salute You', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2),
 (4, 'Let There Be Rock', 1),
 (5, 'Big Ones', 3)]

In order to get a feeling for our data, we look at samples of some of the other tables.

In [7]:
%%sql
SELECT * FROM artists LIMIT 5;

 * sqlite:///Data/Chinook.db
Done.

[(1, 'AC/DC'),
 (2, 'Accept'),
 (3, 'Aerosmith'),
 (4, 'Alanis Morissette'),
 (5, 'Alice In Chains')]

In [8]:
%%sql
SELECT * FROM genres LIMIT 5;

 * sqlite:///Data/Chinook.db
Done.

[(1, 'Rock'),
 (2, 'Jazz'),
 (3, 'Metal'),
 (4, 'Alternative & Punk'),
 (5, 'Rock And Roll')]

In [9]:
%sql SELECT * from tracks LIMIT 5;

 * sqlite:///Data/Chinook.db
Done.

[(1, 'For Those About To Rock (We Salute You)', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 343719, 11170334, 0.99),
 (2, 'Balls to the Wall', 2, 2, 1, None, 342562, 5510424, 0.99),
 (3, 'Fast As a Shark', 3, 2, 1, 'F. Baltes, S. Kaufman, U. Dirkscneider & W. Hoffman', 230619, 3990994, 0.99),
 (4, 'Restless and Wild', 3, 2, 1, 'F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. Dirkscneider & W. Hoffman', 252051, 4331779, 0.99),
 (5, 'Princess of the Dawn', 3, 2, 1, 'Deaffy & R.A. Smith-Diesel', 375418, 6290521, 0.99)]

In [10]:
%%sql
SELECT * FROM playlists LIMIT 5;

 * sqlite:///Data/Chinook.db
Done.

[(1, 'Music'),
 (2, 'Movies'),
 (3, 'TV Shows'),
 (4, 'Audiobooks'),
 (5, '90’s Music')]

In [11]:
%%sql
SELECT * FROM playlist_track LIMIT 5;

 * sqlite:///Data/Chinook.db
Done.

[(1, 3402), (1, 3389), (1, 3390), (1, 3391), (1, 3392)]

In [12]:
%%sql
SELECT * FROM media_types LIMIT 5;

 * sqlite:///Data/Chinook.db
Done.

[(1, 'MPEG audio file'),
 (2, 'Protected AAC audio file'),
 (3, 'Protected MPEG-4 video file'),
 (4, 'Purchased AAC audio file'),
 (5, 'AAC audio file')]

In [13]:
%%sql
SELECT * FROM employees LIMIT 5;

 * sqlite:///Data/Chinook.db
Done.

[(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2002-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com'),
 (2, 'Edwards', 'Nancy', 'Sales Manager', 1, '1958-12-08 00:00:00', '2002-05-01 00:00:00', '825 8 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 2T3', '+1 (403) 262-3443', '+1 (403) 262-3322', 'nancy@chinookcorp.com'),
 (3, 'Peacock', 'Jane', 'Sales Support Agent', 2, '1973-08-29 00:00:00', '2002-04-01 00:00:00', '1111 6 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 5M5', '+1 (403) 262-3443', '+1 (403) 262-6712', 'jane@chinookcorp.com'),
 (4, 'Park', 'Margaret', 'Sales Support Agent', 2, '1947-09-19 00:00:00', '2003-05-03 00:00:00', '683 10 Street SW', 'Calgary', 'AB', 'Canada', 'T2P 5G3', '+1 (403) 263-4423', '+1 (403) 263-4289', 'margaret@chinookcorp.com'),
 (5, 'Johnson', 'Steve', 'Sales Support Agent', 2, '1965-03-03 00:00:00', '2003-10-17 00:00:00', '7727B 41 Ave', 'Calgary', 'AB', 'Canada', 'T3B 1Y7', '1 (780) 836-9987', '1 (780) 836-9543', 'steve@chinookcorp.com')]

In [14]:
%%sql
SELECT * FROM invoice_items LIMIT 5;

 * sqlite:///Data/Chinook.db
Done.

[(1, 1, 2, 0.99, 1),
 (2, 1, 4, 0.99, 1),
 (3, 2, 6, 0.99, 1),
 (4, 2, 8, 0.99, 1),
 (5, 2, 10, 0.99, 1)]

In [15]:
%%sql
SELECT * FROM invoices LIMIT 5;

 * sqlite:///Data/Chinook.db
Done.

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98),
 (2, 4, '2009-01-02 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 3.96),
 (3, 8, '2009-01-03 00:00:00', 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94),
 (4, 14, '2009-01-06 00:00:00', '8210 111 ST NW', 'Edmonton', 'AB', 'Canada', 'T6G 2C7', 8.91),
 (5, 23, '2009-01-11 00:00:00', '69 Salem Street', 'Boston', 'MA', 'USA', '2113', 13.86)]

In [16]:
%%sql
SELECT * FROM customers LIMIT 5;

 * sqlite:///Data/Chinook.db
Done.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3),
 (2, 'Leonie', 'Köhler', None, 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', '+49 0711 2842222', None, 'leonekohler@surfeu.de', 5),
 (3, 'François', 'Tremblay', None, '1498 rue Bélanger', 'Montréal', 'QC', 'Canada', 'H2G 1A7', '+1 (514) 721-4711', None, 'ftremblay@gmail.com', 3),
 (4, 'Bjørn', 'Hansen', None, 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', '+47 22 44 22 22', None, 'bjorn.hansen@yahoo.no', 4),
 (5, 'František', 'Wichterlová', 'JetBrains s.r.o.', 'Klanova 9/506', 'Prague', None, 'Czech Republic', '14700', '+420 2 4172 5555', '+420 2 4172 5555', 'frantisekw@jetbrains.com', 4)]

### The counts
Let's see how many elements there are in our tables.

In [17]:
%sql SELECT COUNT(*) FROM albums;

 * sqlite:///Data/Chinook.db
Done.

[(347,)]

In [18]:
%sql SELECT COUNT(*) FROM artists;

 * sqlite:///Data/Chinook.db
Done.

[(275,)]

In [19]:
%sql SELECT COUNT(*) FROM playlists;

 * sqlite:///Data/Chinook.db
Done.

[(18,)]

In [20]:
%sql SELECT COUNT(*) FROM genres;

 * sqlite:///Data/Chinook.db
Done.

[(25,)]

In [21]:
%sql SELECT count(*) from tracks;

 * sqlite:///Data/Chinook.db
Done.

[(3503,)]

In [22]:
%sql SELECT count(*) from customers;

 * sqlite:///Data/Chinook.db
Done.

[(59,)]

In [23]:
%sql SELECT count(*) from media_types;

 * sqlite:///Data/Chinook.db
Done.

[(5,)]

In [24]:
%sql SELECT count(*) from playlist_track;

 * sqlite:///Data/Chinook.db
Done.

[(8715,)]

In [25]:
%sql SELECT count(*) from employees;

 * sqlite:///Data/Chinook.db
Done.

[(8,)]

In [26]:
%sql SELECT count(*) from invoice_items;

 * sqlite:///Data/Chinook.db
Done.

[(2240,)]

In [27]:
%sql SELECT count(*) from invoices;

 * sqlite:///Data/Chinook.db
Done.

[(412,)]

## Some insights into the DB

### List of albums with composers
We use JOIN in order to combine the information of two tables.

In [28]:
%%sql
SELECT albums.AlbumId, albums.Title, artists.ArtistId, artists.Name FROM albums JOIN artists ON albums.ArtistId = artists.ArtistId LIMIT 10;

 * sqlite:///Data/Chinook.db
Done.

[(1, 'For Those About To Rock We Salute You', 1, 'AC/DC'),
 (2, 'Balls to the Wall', 2, 'Accept'),
 (3, 'Restless and Wild', 2, 'Accept'),
 (4, 'Let There Be Rock', 1, 'AC/DC'),
 (5, 'Big Ones', 3, 'Aerosmith'),
 (6, 'Jagged Little Pill', 4, 'Alanis Morissette'),
 (7, 'Facelift', 5, 'Alice In Chains'),
 (8, 'Warner 25 Anos', 6, 'Antônio Carlos Jobim'),
 (9, 'Plays Metallica By Four Cellos', 7, 'Apocalyptica'),
 (10, 'Audioslave', 8, 'Audioslave')]

Lets count the above.

In [29]:
%%sql
SELECT Count(*) FROM albums JOIN artists ON albums.ArtistId = artists.ArtistId;

 * sqlite:///Data/Chinook.db
Done.

[(347,)]

Next, we select all records in the 'tracks' table referring to the album with AlbumId=58.

In [30]:
%%sql
SELECT * FROM tracks WHERE AlbumId = 58;

 * sqlite:///Data/Chinook.db
Done.

[(745, "Comin' Home", 58, 1, 1, 'Bolin/Coverdale/Paice', 235781, 7644604, 0.99),
 (746, 'Lady Luck', 58, 1, 1, 'Cook/Coverdale', 168202, 5501379, 0.99),
 (747, "Gettin' Tighter", 58, 1, 1, 'Bolin/Hughes', 218044, 7176909, 0.99),
 (748, 'Dealer', 58, 1, 1, 'Bolin/Coverdale', 230922, 7591066, 0.99),
 (749, 'I Need Love', 58, 1, 1, 'Bolin/Coverdale', 263836, 8701064, 0.99),
 (750, 'Drifter', 58, 1, 1, 'Bolin/Coverdale', 242834, 8001505, 0.99),
 (751, 'Love Child', 58, 1, 1, 'Bolin/Coverdale', 188160, 6173806, 0.99),
 (752, "This Time Around / Owed to 'G' [Instrumental]", 58, 1, 1, 'Bolin/Hughes/Lord', 370102, 11995679, 0.99),
 (753, 'You Keep On Moving', 58, 1, 1, 'Coverdale/Hughes', 319111, 10447868, 0.99)]

Then we count the entries in the above table.

In [31]:
%%sql
SELECT COUNT(*) FROM tracks WHERE AlbumId = 58;

 * sqlite:///Data/Chinook.db
Done.

[(9,)]

### List of albums with composers, where composer is Deep Purple

Joining the tables 'artists' and 'albums', we can select all records performed by 'Deep Purple'.

In [32]:
%%sql
SELECT AlbumId, Title, Name  FROM albums JOIN artists ON albums.ArtistId = artists.ArtistId 
     WHERE Name = "Deep Purple";

 * sqlite:///Data/Chinook.db
Done.

[(43, 'MK III The Final Concerts [Disc 1]', 'Deep Purple'),
 (50, 'The Final Concerts (Disc 2)', 'Deep Purple'),
 (58, 'Come Taste The Band', 'Deep Purple'),
 (59, 'Deep Purple In Rock', 'Deep Purple'),
 (60, 'Fireball', 'Deep Purple'),
 (61, "Knocking at Your Back Door: The Best Of Deep Purple in the 80's", 'Deep Purple'),
 (62, 'Machine Head', 'Deep Purple'),
 (63, 'Purpendicular', 'Deep Purple'),
 (64, 'Slaves And Masters', 'Deep Purple'),
 (65, 'Stormbringer', 'Deep Purple'),
 (66, 'The Battle Rages On', 'Deep Purple')]

The following query does the same as the previous one, except that it also includes both 'AristId' columns in the result.

In [33]:
%%sql
SELECT * FROM albums JOIN artists ON albums.ArtistId = artists.ArtistId 
     WHERE Name = "Deep Purple";

 * sqlite:///Data/Chinook.db
Done.

[(43, 'MK III The Final Concerts [Disc 1]', 58, 58, 'Deep Purple'),
 (50, 'The Final Concerts (Disc 2)', 58, 58, 'Deep Purple'),
 (58, 'Come Taste The Band', 58, 58, 'Deep Purple'),
 (59, 'Deep Purple In Rock', 58, 58, 'Deep Purple'),
 (60, 'Fireball', 58, 58, 'Deep Purple'),
 (61, "Knocking at Your Back Door: The Best Of Deep Purple in the 80's", 58, 58, 'Deep Purple'),
 (62, 'Machine Head', 58, 58, 'Deep Purple'),
 (63, 'Purpendicular', 58, 58, 'Deep Purple'),
 (64, 'Slaves And Masters', 58, 58, 'Deep Purple'),
 (65, 'Stormbringer', 58, 58, 'Deep Purple'),
 (66, 'The Battle Rages On', 58, 58, 'Deep Purple')]

### To Pandas
If we prefere to work with Pandas dataframes, we can transform our data appropriately.

In [36]:
dat = sqlite3.connect('Data/Chinook.db')
query = dat.execute("SELECT * From albums JOIN artists ON albums.ArtistId = artists.ArtistId")
cols = [column[0] for column in query.description]
df= pd.DataFrame.from_records(data = query.fetchall(), columns = cols)

In [37]:
df

,AlbumId,Title,ArtistId,ArtistId,Name
0,1,For Those About To Rock We Salute You,1,1,AC/DC
1,2,Balls to the Wall,2,2,Accept
2,3,Restless and Wild,2,2,Accept
3,4,Let There Be Rock,1,1,AC/DC
4,5,Big Ones,3,3,Aerosmith
...,...,...,...,...,...
342,343,Respighi:Pines of Rome,226,226,Eugene Ormandy
343,344,Schubert: The Late String Quartets & String Qu...,272,272,Emerson String Quartet
344,345,Monteverdi: L'Orfeo,273,273,"C. Monteverdi, Nigel Rogers - Chiaroscuro; Lon..."
345,346,Mozart: Chamber Music,274,274,Nash Ensemble
346,347,Koyaanisqatsi (Soundtrack from the Motion Pict...,275,275,Philip Glass Ensemble

Let's list all the albums by AC/DC or Alanis Morissette.

In [38]:
df[(df['Name']=='Alanis Morissette') | (df['Name']=='AC/DC')]

,AlbumId,Title,ArtistId,ArtistId,Name
0,1,For Those About To Rock We Salute You,1,1,AC/DC
3,4,Let There Be Rock,1,1,AC/DC
5,6,Jagged Little Pill,4,4,Alanis Morissette

Finally, let's count the albums of each performer.

In [39]:
df.groupby('Name').count()

,AlbumId,Title,ArtistId,ArtistId
Name,,,,
AC/DC,2,2,2,2
Aaron Copland & London Symphony Orchestra,1,1,1,1
Aaron Goldberg,1,1,1,1
Academy of St. Martin in the Fields & Sir Neville Marriner,1,1,1,1
Academy of St. Martin in the Fields Chamber Ensemble & Sir Neville Marriner,1,1,1,1
...,...,...,...,...
Vinícius De Moraes,1,1,1,1
Wilhelm Kempff,1,1,1,1
Yehudi Menuhin,1,1,1,1
Yo-Yo Ma,1,1,1,1
Zeca Pagodinho,1,1,1,1